// Lab_02.cpp
// < Величко Іван >
// Лабораторна робота № 2.1
// Лінійні програми.
// Варіант 0.4

#include <iostream> //стандартна бібліотека вводу-виводу
#include <cmath>  // для використання математичних функцій

using namespace std; // стандартний простір імен

int main()
{
	double Pi = 4 * atan(1.0); // число пі
	double a; // вхідний параметр
	double z1; // результат обчислення 1-го виразу
	double z2; // результат обчислення 2-го виразу

	cout << "a = "; cin >> a; 
	cout << endl;

	double a1 = a * (Pi / 180.0); // переведення з градусів у радіани

	z1 = (sin(a1) + sin(5 * a1) - sin(3 * a1)) / (cos(a1) - cos(3 * a1) + cos(5 * a1));
	z2 = tan(a1 * 3);
	
	cout << "z1 = " << z1 << endl; // Виведення результату
	cout << "z2 = " << z2 << endl; // Виведення результату
	
	cin.get();
	return 0;
}